# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
#  - [ 19,27,  44,40,  38,94 ]  # P3/8 小
#  - [ 96,68,  86,152,  180,137 ]  # P4/16 中
#  - [ 140,301,  303,264,  238,542 ]  # P5/32 大
  - [ 436,615,  739,380,  925,792 ]  # P6/64 超大

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ReOrg, []],  # 0
   [-1, 1, Conv, [64, 3, 1]],  # 1-P1/2 
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4

   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  # 10  MCB2
         
   [-1, 1, Conv, [256, 3, 2]],  # 11-P3/8

   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 19  MCB2
         
   [-1, 1, Conv, [512, 3, 2]],  # 20-P4/16

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 28  MCB2
         
   [-1, 1, Conv, [768, 3, 2]],  # 29-P5/32

   [-1, 1, Conv, [384, 1, 1]],
   [-2, 1, Conv, [384, 1, 1]],
   [-1, 1, Conv, [384, 3, 1]],
   [-1, 1, Conv, [384, 3, 1]],
   [-1, 1, Conv, [384, 3, 1]],
   [-1, 1, Conv, [384, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [768, 1, 1]],  # 37  MCB2
         
   [-1, 1, Conv, [1024, 3, 2]],  # 38-P6/64

   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 46  MCB2
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 47 SPPCSPC
  
   [-1, 1, Conv, [384, 1, 1]],  
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 49 UP
   [37, 1, Conv, [384, 1, 1]], # route backbone P5  50
   [[-1, -2], 1, Concat, [1]],  # 51
   
   [-1, 1, Conv, [384, 1, 1]],
   [-2, 1, Conv, [384, 1, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [384, 1, 1]], # 59  ELAN-H
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 61 UP
   [28, 1, Conv, [256, 1, 1]], # route backbone P4  62
   [[-1, -2], 1, Concat, [1]],  # 63
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 71  ELAN-H
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # UP 73
   [19, 1, Conv, [128, 1, 1]], # route backbone P3  74
   [[-1, -2], 1, Concat, [1]],  # 75
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 83 ELAN-H
      
   [-1, 1, Conv, [256, 3, 2]],  # 84
   [[-1, 71], 1, Concat, [1]],  # cat  85
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 93  ELAN-H
      
   [-1, 1, Conv, [384, 3, 2]],  # 94 
   [[-1, 59], 1, Concat, [1]],  # cat  95
   
   [-1, 1, Conv, [384, 1, 1]],
   [-2, 1, Conv, [384, 1, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [384, 1, 1]], # 103  ELAN-H
      
   [-1, 1, Conv, [512, 3, 2]],  # 104
   [[-1, 47], 1, Concat, [1]],  # cat  105
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 113 ELAN-H
   
#   [83, 1, Conv, [256, 3, 1]],  # 114  lead head 小
#   [93, 1, Conv, [512, 3, 1]],  # 115 中
#   [103, 1, Conv, [768, 3, 1]],  # 116 大
   [113, 1, Conv, [1024, 3, 1]],  # 114 超大
   
#   [83, 1, Conv, [320, 3, 1]],  # 118  auxiliary head 小
#   [71, 1, Conv, [640, 3, 1]],  # 119 中
#   [59, 1, Conv, [960, 3, 1]],  # 120 大
#   [47, 1, Conv, [1280, 3, 1]],  # 115 超大

   [[114], 1, Detect, [nc, anchors]],   # Detect (P6)
  ]
